/**
 * Типові помилки
 *
 * - Звернення до змінної до її оголошення
 * - Перевизначення значення для змінної оголошеної через const
 * - Обращение по неправильному імени змінної
 *
 */

//!=========================================

// const username = 'Mango';
// console.log(username);
// username = 'Vasya';

// let age = 20;
// const price = 200;

// const userName = 'Vasya';
// console.log(age);

//!=========================================

// const x = 20;
// console.log(x);

//!=========================================
